In [1]:
from __future__ import unicode_literals

import csv
import re
import pandas as pd


character_df = pd.read_csv('character_list5.csv', encoding="ISO-8859-1")

movie_df = pd.read_csv('meta_data7.csv', encoding="ISO-8859-1") 

with open('meta_data7.csv', encoding="ISO-8859-1") as f:
	meta_reader = csv.reader(f)

In [2]:
character_df.head()

   script_id imdb_character_name  words gender  age
0        280               betty    311      f   35
1        280     carolyn johnson    873      f  NaN
2        280             eleanor    138      f  NaN
3        280     francesca johns   2251      f   46
4        280               madge    190      f   46

In [3]:
movie_df.head()

,script_id,imdb_id,title,year,gross,lines_data
0,1534,tt1022603,(500) Days of Summer,2009,37,7435445256774774443342577775657744434444564456...
1,1512,tt0147800,10 Things I Hate About You,1999,65,1777752320274533344457777722433777334443764677...
2,1514,tt0417385,12 and Holding,2005,NaN,5461357777754212454544441367774433446547647753...
3,1517,tt2024544,12 Years a Slave,2013,60,4567334777777777777777447777756477777444777777...
4,1520,tt1542344,127 Hours,2010,20,453513352345765766777777773340

In [7]:
import pandas as ps

page = 'numbers_budgets.html'
df_budgets = pd.read_html(page)

In [12]:

dfb = df_budgets[0]
headers = dfb.loc[0][1:]
dfb = dfb[[1,2,3,4,5]][1:]
dfb.columns = headers
dfb = dfb.dropna()
#dfb
dfb.columns = ['year', 'title', 'budget', 'Domestic Gross','Worldwide Gross']

In [25]:
dfb.head()
for i in range(len(dfb)):
    #print(year)
    tmpyear = dfb.iloc[i,0]
    year = tmpyear[-4:]
    dfb.iloc[i,0]=year
    
    
    #print(year)

In [26]:
dfb.head()

,year,title,budget,Domestic Gross,Worldwide Gross
1,2009,Avatar,"$425,000,000","$760,507,625","$2,783,918,982"
3,2015,Star Wars Ep. VII: The Force Awakens,"$306,000,000","$935,832,841","$2,057,832,841"
5,2007,Pirates of the Caribbean: At World's End,"$300,000,000","$309,420,425","$963,420,425"
7,2015,Spectre,"$300,000,000","$200,074,175","$879,620,923"
9,2012,The Dark Knight Rises,"$275,000,000","$448,139,099","$1,084,439,099"

In [29]:
# from __future__ import unicode_literals
# import platform
# import warnings

# try:
#     from .StringMatcher import StringMatcher as SequenceMatcher
# except ImportError:
#     if platform.python_implementation() != "PyPy":
#         warnings.warn('Using slow pure-python SequenceMatcher. Install python-Levenshtein to remove this warning')
#     from difflib import SequenceMatcher

# from . import utils

from fuzzywuzzy import fuzz

In [31]:
import difflib

In [56]:
# dfb.groupby(['year', 'title'])


movie_df["movie"] = movie_df["year"].map(str) + " " + movie_df["title"]
dfb["movie"] = dfb["year"].map(str) + " " + dfb["title"]

# movie_df.groupby(['year', 'title'])
df_new = pd.merge(dfb, movie_df, on=['movie'])

In [60]:
#print(dfb.head())
print(df_new.head())

  year_x                                   title_x        budget  \
0   2009                                    Avatar  $425,000,000
1   2007  Pirates of the Caribbean: At World's End  $300,000,000
2   2012                     The Dark Knight Rises  $275,000,000
3   2009    Harry Potter and the Half-Blood Prince  $250,000,000
4   2012                              The Avengers  $225,000,000

  Domestic Gross Worldwide Gross  \
0   $760,507,625  $2,783,918,982
1   $309,420,425    $963,420,425
2   $448,139,099  $1,084,439,099
3   $301,959,197    $935,083,686
4   $623,279,547  $1,519,479,547

                                           movie  script_id    imdb_id  \
0                                    2009 Avatar       1718  tt0499549
1  2007 Pirates of the Caribbean: At World's End       8352  tt0449088
2                     2012 The Dark Knight Rises       8807  tt1345836
3    2009 Harry Potter and the Half-Blood Prince       4339  tt0417741
4                              2012 The Avengers       1723  tt0848228

                                    title_y  year_y  gross  \
0                                    Avatar    2009    882
1  Pirates of the Caribbean: At World's End    2007    390
2                     The Dark Knight Rises    2012    489
3    Harry Potter and the Half-Blood Prince    2009    350
4                              The Avengers    2012    680

                                          lines_data
0  7777777434446445734332423436443353445774262324...
1  2576777414665772667657777657675446555777777777...
2  7776764367777743147777777477772234317777777675...
3  1333377777515676452546347745467457776744256366...
4  7777777433343447777554355344575666675655777777...

In [39]:
print(len(df_new))
print(len(dfb))
print(len(movie_df))
print(movie_df.loc[,'imdb_id'])

1317
5117
2000
    script_id    imdb_id                  title  year  gross  \
8        1525  tt0974661               17 Again  2009     74
9        6030  tt1272878                 2 Guns  2013     80
10        625  tt0062622  2001: A Space Odyssey  1968    376
11       1509  tt1190080                   2012  2009    192
12       8543  tt0478087                     21  2008     98

                                           lines_data
8   7667676775564344777777776764653356777477725754...
9   3676577777777757676674257563677777577777777777...
10  7777734457575677777777777777777777777777777777...
11  7777634467206776677776457663674466677643166554...
12  6677777777777777667777777654777777556537777767...

In [ ]:
for i in range(len(df_new)):